{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["z_sampling", 0, 0]], "name": "decoder", "layers": [{"config": {"batch_input_shape": [null, 22], "name": "z_sampling", "dtype": "float32", "sparse": false}, "name": "z_sampling", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "dense_2", "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.1, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "activation": "linear", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 8192, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32"}, "name": "dense_2", "inbound_nodes": [[["z_sampling", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"target_shape": [8, 16, 64], "name": "reshape", "trainable": true, "dtype": "float32"}, "name": "reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Reshape"}, {"config": {"strides": [1, 1], "padding": "same", "name": "conv2d_4", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 1024, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "name": "batch_normalization_4", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "gamma_regularizer": null, "scale": true, "center": true, "axis": [3], "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "same", "name": "conv2d_transpose", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "output_padding": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 8, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_transpose", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"strides": [1, 1], "padding": "same", "name": "conv2d_5", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "name": "batch_normalization_5", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "gamma_regularizer": null, "scale": true, "center": true, "axis": [3], "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "same", "name": "conv2d_transpose_1", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "output_padding": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 8, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_transpose_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"strides": [1, 1], "padding": "same", "name": "conv2d_6", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 256, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "name": "batch_normalization_6", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "gamma_regularizer": null, "scale": true, "center": true, "axis": [3], "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "same", "name": "conv2d_transpose_2", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "output_padding": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 8, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_transpose_2", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"strides": [1, 1], "padding": "same", "name": "conv2d_7", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "name": "batch_normalization_7", "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "gamma_regularizer": null, "scale": true, "center": true, "axis": [3], "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "same", "name": "conv2d_transpose_3", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "output_padding": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_transpose_3", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"strides": [1, 1], "padding": "same", "name": "conv2d_8", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "sigmoid", "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 1, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "Conv2D"}], "output_layers": [["conv2d_8", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}