{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 22], "name": "z_sampling"}, "name": "z_sampling", "inbound_nodes": []}, {"class_name": "Dense", "config": {"dtype": "float32", "units": 8192, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "name": "dense_2", "kernel_initializer": {"class_name": "RandomNormal", "config": {"dtype": "float32", "seed": null, "mean": 0.0, "stddev": 0.1}}}, "name": "dense_2", "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "target_shape": [8, 16, 64], "name": "reshape"}, "name": "reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "filters": 1024, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_4", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": [3], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_4", "beta_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "filters": 8, "output_padding": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_transpose", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_transpose", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_5", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": [3], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_5", "beta_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "filters": 8, "output_padding": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_transpose_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_transpose_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "filters": 256, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": [3], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_6", "beta_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "filters": 8, "output_padding": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_transpose_2", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_transpose_2", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_7", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "axis": [3], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_7", "beta_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "filters": 64, "output_padding": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_transpose_3", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_transpose_3", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "filters": 1, "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "kernel_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}, "name": "conv2d_8", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}], "name": "decoder", "output_layers": [["conv2d_8", 0, 0]], "input_layers": [["z_sampling", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}