{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 22], "dtype": "float32", "name": "z_sampling"}, "inbound_nodes": [], "name": "z_sampling", "class_name": "InputLayer"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_2", "units": 8192, "bias_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.1, "seed": null, "dtype": "float32"}, "class_name": "RandomNormal"}, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "reshape", "target_shape": [8, 16, 64]}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "reshape", "class_name": "Reshape"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 1024, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1]}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_4", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "center": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "axis": [3], "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 8, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_transpose", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_transpose", "class_name": "Conv2DTranspose"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 512, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_5", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_5", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "center": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "axis": [3], "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 8, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_transpose_1", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 256, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_6", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_6", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "center": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "axis": [3], "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 8, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_transpose_2", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "conv2d_transpose_2", "class_name": "Conv2DTranspose"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_7", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_7", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "center": true, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "axis": [3], "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_transpose_3", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_transpose_3", "class_name": "Conv2DTranspose"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 1, "padding": "same", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_8", "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "trainable": true, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D"}], "input_layers": [["z_sampling", 0, 0]], "name": "decoder", "output_layers": [["conv2d_8", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}