{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["z_sampling", 0, 0]], "name": "decoder", "layers": [{"inbound_nodes": [], "name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "sparse": false, "dtype": "float32", "name": "z_sampling"}}, {"inbound_nodes": [[["z_sampling", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"units": 8192, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.1, "dtype": "float32"}}, "name": "dense_2"}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "target_shape": [8, 16, 64], "dtype": "float32"}}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_4", "filters": 1024, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "dtype": "float32", "name": "batch_normalization_4"}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_transpose", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_transpose", "filters": 8, "kernel_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_5", "filters": 512, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "dtype": "float32", "name": "batch_normalization_5"}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_transpose_1", "filters": 8, "kernel_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_6", "filters": 256, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "dtype": "float32", "name": "batch_normalization_6"}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_transpose_2", "filters": 8, "kernel_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_7", "filters": 64, "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "axis": [3], "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "dtype": "float32", "name": "batch_normalization_7"}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_transpose_3", "filters": 64, "kernel_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activation": "sigmoid", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "conv2d_8", "filters": 1, "kernel_constraint": null}}], "output_layers": [["conv2d_8", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}