{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "name": "z_sampling", "config": {"name": "z_sampling", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 22]}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.1, "mean": 0.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "units": 8192, "name": "dense_2", "kernel_constraint": null, "trainable": true}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape", "config": {"target_shape": [8, 16, 64], "name": "reshape", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 1024, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_4", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_transpose", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 8, "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 512, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_5", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_transpose_1", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 8, "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 256, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_6", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_transpose_2", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 8, "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_7", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_transpose_3", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "trainable": true, "output_padding": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "activation": "sigmoid", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 1, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}], "output_layers": [["conv2d_8", 0, 0]], "input_layers": [["z_sampling", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}