{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["conv2d_8", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "z_sampling", "batch_input_shape": [null, 22], "sparse": false}, "name": "z_sampling", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"stddev": 0.1, "seed": null, "dtype": "float32", "mean": 0.0}, "class_name": "RandomNormal"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "linear", "units": 8192, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "kernel_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "reshape", "trainable": true, "target_shape": [8, 16, 64]}, "name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 1024, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_4", "padding": "same"}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "dtype": "float32", "axis": [3], "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_4", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true}, "name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [2, 2], "output_padding": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 8, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_transpose", "padding": "same"}, "name": "conv2d_transpose", "class_name": "Conv2DTranspose", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_5", "padding": "same"}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "dtype": "float32", "axis": [3], "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_5", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true}, "name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [2, 2], "output_padding": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 8, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_transpose_1", "padding": "same"}, "name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_6", "padding": "same"}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "dtype": "float32", "axis": [3], "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_6", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true}, "name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [2, 2], "output_padding": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 8, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_transpose_2", "padding": "same"}, "name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_7", "padding": "same"}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "dtype": "float32", "axis": [3], "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_7", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true}, "name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [2, 2], "output_padding": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_transpose_3", "padding": "same"}, "name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "activation": "sigmoid", "filters": 1, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "conv2d_8", "padding": "same"}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "name": "decoder"}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}