{"modelTopology":{"class_name":"Model","config":{"name":"new Encoder","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,128,256,1],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"encoder","class_name":"Model","config":{"name":"encoder","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,128,256,1],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"conv2d","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d","trainable":true},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"batch_normalization","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization","trainable":true},"inbound_nodes":[[["conv2d",0,0,{}]]]},{"name":"max_pooling2d","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d","trainable":true},"inbound_nodes":[[["batch_normalization",0,0,{}]]]},{"name":"conv2d_1","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_1","trainable":true},"inbound_nodes":[[["max_pooling2d",0,0,{}]]]},{"name":"batch_normalization_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_1","trainable":true},"inbound_nodes":[[["conv2d_1",0,0,{}]]]},{"name":"max_pooling2d_1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_1","trainable":true},"inbound_nodes":[[["batch_normalization_1",0,0,{}]]]},{"name":"conv2d_2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_2","trainable":true},"inbound_nodes":[[["max_pooling2d_1",0,0,{}]]]},{"name":"batch_normalization_2","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_2","trainable":true},"inbound_nodes":[[["conv2d_2",0,0,{}]]]},{"name":"max_pooling2d_2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_2","trainable":true},"inbound_nodes":[[["batch_normalization_2",0,0,{}]]]},{"name":"conv2d_3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_3","trainable":true},"inbound_nodes":[[["max_pooling2d_2",0,0,{}]]]},{"name":"batch_normalization_3","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_3","trainable":true},"inbound_nodes":[[["conv2d_3",0,0,{}]]]},{"name":"max_pooling2d_3","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_3","trainable":true},"inbound_nodes":[[["batch_normalization_3",0,0,{}]]]},{"name":"flatten","class_name":"Flatten","config":{"name":"flatten","trainable":true},"inbound_nodes":[[["max_pooling2d_3",0,0,{}]]]},{"name":"dense","class_name":"Dense","config":{"units":20,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true},"inbound_nodes":[[["flatten",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"units":20,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true},"inbound_nodes":[[["flatten",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense",0,0],["dense_1",0,0]]},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"z","class_name":"ZLayer","config":{"name":"z","trainable":true},"inbound_nodes":[[["encoder",1,0,{}],["encoder",1,1,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["z",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d/kernel","shape":[3,3,1,64],"dtype":"float32"},{"name":"conv2d/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_1/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"conv2d_1/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_1/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_1/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_2/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"conv2d_2/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_3/kernel","shape":[3,3,64,64],"dtype":"float32"},{"name":"conv2d_3/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/beta","shape":[64],"dtype":"float32"},{"name":"dense/kernel","shape":[8192,20],"dtype":"float32"},{"name":"dense/bias","shape":[20],"dtype":"float32"},{"name":"dense_1/kernel","shape":[8192,20],"dtype":"float32"},{"name":"dense_1/bias","shape":[20],"dtype":"float32"},{"name":"batch_normalization/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_1/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_1/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_2/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_3/moving_variance","shape":[64],"dtype":"float32"}]}]}