{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 128, 256, 1], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 64, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d", "pool_size": [2, 2], "padding": "same", "dtype": "float32", "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 64, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "same", "dtype": "float32", "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 64, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "same", "dtype": "float32", "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 64, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "same", "dtype": "float32", "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense", "config": {"trainable": true, "units": 20, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "units": 20, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0], ["dense_1", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [8192, 20], "dtype": "float32"}, {"name": "dense/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [8192, 20], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [20], "dtype": "float32"}]}]}