{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 128, 256, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d", "config": {"pool_size": [2, 2], "name": "max_pooling2d", "padding": "same", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_2", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "filters": 64, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "center": true, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_3", "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [3]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"name": "flatten", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "units": 20, "name": "dense", "kernel_constraint": null, "trainable": true}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "units": 20, "name": "dense_1", "kernel_constraint": null, "trainable": true}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "output_layers": [["dense", 0, 0], ["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [8192, 20], "dtype": "float32"}, {"name": "dense/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [8192, 20], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [20], "dtype": "float32"}]}]}