{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "name": "z_sampling", "config": {"sparse": false, "batch_input_shape": [null, 22], "dtype": "float32", "name": "z_sampling"}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_2", "config": {"trainable": true, "units": 8192, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.1, "mean": 0.0, "dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape", "config": {"target_shape": [8, 16, 64], "name": "reshape", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 1024, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 8, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_transpose", "strides": [2, 2], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "output_padding": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 512, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_5", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 8, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_transpose_1", "strides": [2, 2], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "output_padding": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 256, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_6", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 8, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_transpose_2", "strides": [2, 2], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "output_padding": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 64, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_7", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "dtype": "float32", "beta_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_transpose_3", "strides": [2, 2], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "output_padding": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "filters": 1, "activation": "sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_8", "strides": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["conv2d_8", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 1024], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [1], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 8, 1024], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 8, 512], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 8, 256], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [22, 8192], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8192], "dtype": "float32"}]}]}